/*
yes: 첫 번째 칸에 동물이 들어가있었다면 두 번째 칸을 이루는 경우의 수는 2 (왼쪽 혹은 오른쪽 + 안 넣는 경우)
no: 첫 번째 칸에 동물이 들어가있지 않았다면 두 번째 칸을 이루는 경우의 수는 3 (왼쪽 + 오른쪽 + 안 넣는 경우)
쪼개서 보면:
  -1: 왼쪽에 사자 / 0: 사자 없음 / 1: 오른쪽에 사자
  이전 단계 = -1 ---> 이번 단계 = 0 혹은 1
  이전 단계 = 0 ---> 이번 단계 = -1 혹은 0 혹은 1
  이전 단계 = 1 ---> 이번 단계 = -1 혹은 0
수식으로:
  이번 단계에 동물이 들어가는 경우의 수 = 앞 단계에서 동물이 들어간 경우의 수 + 앞 단계에서 동물이 안 들어간 경우의 수 *2
          이번 단계에 동물이 안 들어가는 경우의 수 = 앞 단계에서 동물이 들어간 경우의 수 + 앞 단계에서 동물이 안 들어간 경우의 수

*/
#include <iostream>
using namespace std;

int main() {
	int cnt;
	cin >> cnt;

	int yes = 2; 
	int no = 1;
	int y, n;
	for (int i = 1; i < cnt; i++) {
		y = yes; n = no;
		yes = (y + n * 2) % 9901; 
		no = (y + n) % 9901;
	}
	cout << (yes + no) % 9901;
}
